transformation-library/src/test/resources/locationsummary/dsq.response/permitNumberSuccess.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">e0e16366-8e7f-41b4-aff4-e6f7007a38c3</cais:TrackingId>
    <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">d3b5216c-91e8-4330-abf0-ad74b3753d03</cais:TransactionId>
    <cais:SessionID xmlns:cais="http://cais-icp.org/v1">e28edc0827b64c30a4d55cdcfeece</cais:SessionID>
  </s:Header>
  <s:Body>
    <PRLO_IN202011CAQC_V01 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ITSVersion="XML_1.0"
                           xmlns="urn:hl7-org:v3">
      <id root="ba8da8b9-9293-43a3-b27f-6bd4db601d1b"/>
      <creationTime value="20211210182936"/>
      <responseModeCode code="I"/>
      <versionCode code="NE2006"/>
      <interactionId root="2.16.124.10.101.1.60.3.16" extension="PRLO_IN202011CAQC_V01" displayable="true"/>
      <processingCode code="D"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="senderRoot" extension="senderApplicationId" displayable="true" use="BUS"/>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </receiver>
      <respondTo xsi:nil="true"/>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
          <name>Registre ODS/LDS</name>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id root="e697641c-4456-4e19-a882-06397811ffb2"/>
        </targetMessage>
      </acknowledgement>
      <controlActEvent classCode="CACT" moodCode="EVN">
        <id root="eventRoot" extension="eventCorrelationId" displayable="true" use="BUS"/>
        <code code="PRLO_TE202011CA"/>
        <statusCode code="completed"/>
        <subject typeCode="SUBJ" contextControlCode="ON" contextConductionInd="true">
          <registrationRequest classCode="REG" moodCode="RQO">
            <statusCode code="active"/>
            <subject typeCode="SBJ" contextControlCode="AN">
              <serviceDeliveryLocation classCode="SDLOC">
                <id root="2.16.840.1.113883.4.273" extension="1000037653" displayable="true"/>
                <code code="AUT"/>
                <name>CENTRE LABRIE</name>
                <addr use="PHYS">
                  <streetAddressLine partType="SAL">659 BOUL BLANCHE</streetAddressLine>
                  <additionalLocator partType="ADL">BAIE-COMEAU, QC</additionalLocator>
                  <city partType="CTY">BAIE-COMEAU</city>
                  <postalCode partType="ZIP">G5C2B2</postalCode>
                </addr>
                <statusCode code="NI"/>
                <location classCode="PLC" determinerCode="INSTANCE">
                  <code code="BLDG"/>
                  <mobileInd value="false"/>
                </location>
                <indirectAuthority typeCode="INDAUTH">
                  <territorialAuthority classCode="TERR">
                    <id root="2.16.124.10.101.1.60.1.10" extension="09" displayable="true"/>
                  </territorialAuthority>
                </indirectAuthority>
              </serviceDeliveryLocation>
            </subject>
            <custodian typeCode="CST" contextControlCode="AP">
              <assignedDevice classCode="ASSIGNED">
                <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
                <assignedRepository classCode="DEV" determinerCode="INSTANCE">
                  <name>Registre ODS/LDS</name>
                </assignedRepository>
                <representedRepositoryJurisdiction classCode="STATE" determinerCode="INSTANCE">
                  <name>Québec</name>
                </representedRepositoryJurisdiction>
              </assignedDevice>
            </custodian>
          </registrationRequest>
        </subject>
        <queryAck>
          <queryId root="e697641c-4456-4e19-a882-06397811ffb2"/>
          <queryResponseCode code="OK"/>
          <resultTotalQuantity value="1"/>
          <resultCurrentQuantity value="1"/>
          <resultRemainingQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <queryId root="e697641c-4456-4e19-a882-06397811ffb2"/>
          <parameterList>
            <address xsi:nil="true"/>
            <amendedSinceDateTime xsi:nil="true"/>
            <eHRRepositoryId xsi:nil="true"/>
            <locationMobileIndicator xsi:nil="true"/>
            <locationPlaceType xsi:nil="true"/>
            <nameContains xsi:nil="true"/>
            <nearAddress xsi:nil="true"/>
            <responsibleOrganizationId xsi:nil="true"/>
            <searchRadius xsi:nil="true"/>
            <OtherIDs>
              <value root="2.16.124.10.101.1.60.101" extension="51221471" displayable="true"/>
            </OtherIDs>
          </parameterList>
        </queryByParameter>
      </controlActEvent>
    </PRLO_IN202011CAQC_V01>
  </s:Body>
</s:Envelope>